
def area(a):
        '''
    Возвращает площадь квадрата

            Параметры:
                a (int) : сторона квадрата

                Возвращаемое значение:
                    Площадь квадрата, заданного стороной
    '''

    return a * a


def perimeter(a):
    '''
    Возвращает периметр квадрата

            Параметры:
                a (int) : сторона квадрата

                Возвращаемое значение:
                    Периметр квадрата, заданного стороной
    '''

    return 4 * a
